Revit 2024 API
LightFamily.GetLightShapeStyle Method
 Returns a LightShapeStyle value for the light shape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LightShapeStyle GetLightShapeStyle()
Visual Basic
Public Function GetLightShapeStyle As LightShapeStyle
Visual C++
public:
LightShapeStyle GetLightShapeStyle()
See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace